import random


def print_banner():
    subtitles = [
        "Pinnacle of Operational Security",
        "Pinnacle of Cyber Defense Intelligence",
        "Pinnacle of Threat-Aware Triage",
        "Pinnacle of Real-World Risk Insight",
        "Pinnacle of Defensive Strategy",
        "Pinnacle of Tactical Risk Management",
        "Pinnacle of Security Analytics Wizardry"
    ]
    
    selected_subtitle = random.choice(subtitles)
    
    banner = r"""
    ██████╗ ██╗███╗   ██╗███╗   ██╗ █████╗  ██████╗██╗     ███████╗
    ██╔══██╗██║████╗  ██║████╗  ██║██╔══██╗██╔════╝██║     ██╔════╝
    ██████╔╝██║██╔██╗ ██║██╔██╗ ██║███████║██║     ██║     █████╗  
    ██╔═══╝ ██║██║╚██╗██║██║╚██╗██║██╔══██║██║     ██║     ██╔══╝  
    ██║     ██║██║ ╚████║██║ ╚████║██║  ██║╚██████╗███████╗███████╗
    ╚═╝     ╚═╝╚═╝  ╚═══╝╚═╝  ╚═══╝╚═╝  ╚═╝ ╚═════╝╚══════╝╚══════╝

                    VulnParse-Pinnacle  
                Enrich ✦ Prioritize ✦ Defend
            {}
                    Developer: QTShade
    """.format(selected_subtitle)
    
    
    print(banner)
    print("=" * 75)
